// faq.js - файл с вопросами и ответами для FAQ
const faqData = [
    {
        question: "Как зарегистрироваться?",
        answer: "Зайдите на сервер, и введите «/reg <пароль> <повтор пароля>». Для авторизации введите «/log <пароль>»."
    },
    {
        question: "Как получить роль больше чем «игрок»?",
        answer: "Можете подать заявку на роль «Модератор» или «Бета-тестер», у администратора @Nerix_CM. На данный момент сервер требуется только в «Бета-тестер»."
    },
    {
        question: "Как предложить свою идею для сервера?",
        answer: "Можете обратиться к администратору @Nerix_CM, рассказав от своей идее подробно."
    },
    {
        question: "Как поставить свой скин?", 
        answer : "Чтобы поставить свой скин, для начала нарисуйте его или скачайте, например на namemc.com. Убедитесь что формат изображения «.png», и размер не более 64х64. Перейдите во вкладку «Установка скина», загрузите ваше изображение, выберите плащ(по желанию). Как все сделаете нажмите «Generate /skin url», вам выдаст команду, ее нужно ввести на сервере."
    },
    {
        question: "Какая версия?",
        answer: "Родная версия 1.21.11+, но также можно зайти с 1.20-1.21.10."
    }, 
    {
        question Когда вайп?", 
        answer: "В основном сезон длится 3 месяца, но может быть длиннее и короче! Все зависит от игроков."
    }
];
